iar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>亦幻亦真/Illusory and Real</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">亦幻亦真/Illusory and Real</h1>
<p>
Many years ago, on a whim, I wrote a little something - a TrueCrypt/VeraCrypt
launcher. Little did I know at the time that this piece of code would become the
starting point of my journey into heavy encryption.
</p>

<p>
The time when the story began feels distant now. For the purpose of privacy
protection, I was searching for a reliable encryption software, and TrueCrypt
became my choice, until 2014, I switched to VeraCrypt.
</p>

<p>
&gt; (*) Reason: <a href="https://jsntn.com/software/2014/06/01/truecrypt.html">https://jsntn.com/software/2014/06/01/truecrypt.html</a>, in fact, I
am still using both TrueCrypt and VeraCrypt simultaneously.
</p>

<p>
However, the tedious process of opening the software, selecting the encrypted
volume, entering the password, and manually mounting the disk every time made me
tired. I needed a simple and efficient way to manage my encrypted volumes, so I
started conceptualizing and designing a launcher.
</p>

<p>
Then, in 2021, I open-sourced this launcher and put it on
<a href="https://github.com/jsntn/veracrypt-launcher">https://github.com/jsntn/veracrypt-launcher</a>.
</p>

<p>
I have polished it over the years, using and iterating continuously, and I
believe it has become a very complete version now.
</p>

<p>
This launcher has many highlights, let me tell you about them one by one:
</p>

<ul class="org-ul">
<li>First of all, it is a portable application, with no need for troublesome
installation. With just one click, you can happily use it.
</li>

<li>Secondly, I have built-in support for TrueCrypt/VeraCrypt, making it easy for
you to encrypt your data.
</li>

<li>Moreover, the launcher has a fantastic feature. By using corresponding batch
files, you can easily mount volumes in read-only or read/write mode, giving
your data the best protection in different scenarios.
</li>

<li>Not only that, the launcher also supports a single configuration INI file,
allowing you to customize your decryption settings.
</li>

<li>Furthermore, you can specify a specific drive or let the launcher
automatically find an available drive letter.
</li>

<li>Lastly, I can proudly tell you that it is very stable and reliable.
</li>
</ul>

<p>
Today, I cautiously released version 0.1.0 of this launcher, which is my first
step towards perfection. I consider it a gift for you, who, like me, love
privacy and encryption.
</p>

<p>
If you don't know what TrueCrypt/VeraCrypt is, I recommend you to learn about it
immediately. It can effectively protect your personal privacy and important
data. To put it in a grander way, it is not just a tool, but a manifestation of
values.
</p>

<p>
However, if you find that VeraCrypt is not useful for you after using it, I can
give you some advice to help you discover its applicable scenarios:
</p>

<ul class="org-ul">
<li>You can use it as a storage volume for your portable software, protecting your
data privacy.
</li>

<li>When you need to handle fragmented files, it can also serve as your storage
volume, solving the efficiency and encryption issues of cloud synchronization.
</li>

<li>You can also combine it with external hard drives or NAS for more stringent
data protection.
</li>
</ul>

<p>
Don't forget, these scenarios can be easily implemented on your personal
devices. And with the help of the launcher on the PC platform, starting
TrueCrypt/VeraCrypt becomes even quicker and more convenient.
</p>

<p>
I even feel that everyone should use VeraCrypt-like software to encrypt their
data on their personal devices. It should be used even more on non-personal
devices because we are unsure and cannot control their security.
</p>

<p>
Finally, I have said so much.
</p>

<p>
This little launcher, carrying my love for privacy protection, will continue to
accompany me every day on my PC.
</p>

<p>
In the virtual world, both illusory and real.
</p>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br /><span class="timestamp-wrapper"><span class="timestamp">[2023-07-24 Mon 21:09]</span></span></p>
</div>
</body>
</html>
